<?php

namespace Miladabdi\PersianFaker\Provider;

class Text extends Base
{
    protected static array $word = ['ساعت','ماشین','موبایل','تلفن','لپ تاپ','رایانه','یارانه','کامپیوتر','گیاه','درخت','بادمجان','میز','بخاری','پنجره','تخت','سینی','فلش','هارد دیسک','دانشگاه','تهران','مانیتور','دوربین','لامپ','تراکتور','هیوندای','کاج','مهندس','نرم افزار','پرچم','شرکت','باتری','بخاری','توپ','دروازه','اسپیکر','سامسونگ','اپل','نوکیا','دنا','سمند','سانتافه','حساس','ترافیک','فروش','سایت','ارگانیک','افزایش','نرخ', 'سئو','کاربردی','ابزار','بهبود','تجربه','بهبود','فروشگاه','سرعت','جستجو','موتورهای جستجو','آن ین','لینک','حرفه','کلیک','مخاطب','صفحه','تصاویر','اشتراک',' شبکه ها اجتماعی','محصول', ' آن ین','توسعه دهنده','حرفه ای','فاکتور','بهینه سازی','ترافیک','پروتکل','امنیت','محتوا','دانلود','رایگان','استاندارد','خرید','رتبه بندی','الگوریتم های گوگل','وب گردی','وب گ نوس','مخاطب','رپورتاژ خبری','مقایسه',' اط عات','نقشه','برچسب','بانک','چشمپوشی','اینترنت','پیامرسان','دولت','حمایت','هیولا','یادداشت','لینوکس','هوشمند','عروسک','رباتیک','کودکان','کتاب','روزرسانی','وبمستر','آنالیتیکس','فروشگاه','جامدادی','زاینده رود','دریا','ترمینال','پتو','ناتو','هواپیما','تانک','جیپ','رادیاتور','فرانت اند','بک اند','شبکه','ماهواره','ایستگاه فضایی','تلسکوپ','شارژر','کیبورد','کولر','دفترچه','تامین اجتماعی','وزارتخانه','پرده','شامپو','صابون گلنار','سرامیک','فرش','فرش دستباف','صندلی','دوره آموزشی','خودکار','قلم چی','بازار موبایل','کلید سازی','ریموت','پارکینگ','یاهو','کافه','قهوه ترک','سون لرن','کاغذ','اموجی','صدا و سیما','رادیو','دوربین','لاراول','پایتون','جاوا','کامپایلر','سیسکو','مایکروسافت','وردپرس','جوملا','وکامرس','پیچ خودکار','سوئیچ','روتر','مودم','اسپلیتر','کابل شبکه','سوکت شبکه','آچار شبکه','سرور','هاست','سئو','هک و امنیت','آماتور','آنتن','اندروید','ویندوز','انگولار','ری اکت','فریمورک','کتابخانه','جی کوئری','گیت هاب','خمیر سیلیکون','کارت گرافیک','بیت کوین','بلاکچین','جادی','هوش مصنوعی','ساختمان داده','طراحی الگوریتم','دانشگاه آزاد','کامپوزر','گیت لب','کالاف دیوتی','اینتل','تویوتا','بنز','توشیبا','سونی','هارد دیسک','کارشناسی ارشد','گلابی','سیب','پرتقال','خیار','کمد دیواری','انباری','اینترنت همراه','بازار مبل','محیط زیست','سی شارپ','ویژوال بیسیک','حلقه','هندزفری','برنامه','ریاضیات','کنکور','ارز دیجیتال','فارکس','سایپا','آچار فرانسه','سه پایه دوربین','لنز دوربین','قالب گوشی','پاور بانک','پرینتر','فکس','اسپیکر','کارت حافظه','کابل صدا','کارت صدا','سانترال','پلی استیشن','کارت هدیه','لنت ترمز','مکمل سوخت','فیلتر هوا','فیلتر روغن','تسمه تایم','دریل','نردبان','تلگرام','واتساپ','سازمان سنجش','چسب صنعتی','فازمتر','گاوصندوق','پیراهن','شلوار','کالسکه','دوچرخه','تلویزیون','مبلمان خانگی','دکوراسیون اداری','ماشین لباسشویی','اینستاگرام','پیانو دیجیتال','گیتار','کارت شبکه','سیستم عامل','فتوشاپ','آپارات','بلاگفا','شیپور','مدرسه','وبسایت','دبیرستان','کرکره برقی','فلافل','هات داگ','پیتزا','کباب کوبیده','منقل','سیخ','قلیان','سیگار','ترمینال','جعبه فیوز','جعبه ابزار','کنتر گاز','کشتی','فیلم سینمایی','برج ایفل','برج میلاد','استقلال','مس سرچشمه','صنعت نفت','رئال مادرید','میهن','بستنی سالار','فلاپی دیسک','سیمفونی','تاکسی','اسنپ','کریسمس','تایر',];

    protected static array $sentence =  [
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ',
        'بابا نان داد و علی آنرا خورد.',
        'مشکلات اقتصادی گریبان گیر همه ی ما است.',
        'تا شقایق هست زندگی باید کرد.',
        'زندگی با داشتن آرامش روحی و روانی زیبا تر خواهد بود.',
        'مشکلات ما با اطرافیانمان اغلب در نگرش ما است',
        'آنجا که سکوت حاکم میشود موسیقی آغاز می شود.',
        'هر روز یک روز زیبا برای انجام کار های درست است زمان را از دست ندهیم.',
        'فرصت ها از دست ندهیم ، فرصت همیشگی نیستند.',
        'زندگی از آن ماست ما آن را به روش خودمان پیش میبریم.',
        'تاریخ دو بار تکرار میشود : یکی به صورت تراژدی و دیگری به صورت کمدی.',
        'کاری نکنیم که باعث شود از جهره خود در آینه فراری باشیم.',
        'دریافت اطلاعات درباره نحوه دسترسی مخاطبان به سایت و نحوه رفتار آنها',
        'مشخص کردن دامنه ایده آل برای سایت شما',
        'مشخص کردن مشکلات موجود در عناوین و متای توضیحات صفحات سایت',
        'شناخت کلیدواژ ه های برتر در جستجو که به دیده شدن سایت کمک می کند',
        'ارائه یک نما از نحوه خوانش سایت توسط ربات های گوگل',
        'دریافت اطلاعات درباره نحوه دسترسی مخاطبان به سایت و نحوه رفتار آنها',
        'در شبکه های اجتماعی فعالتر باشید',
        'درج ویژگی Alt هنگامیکه از عکس بعنوان لینک استفاده می کنید',
        'تحقیق کلمات کلیدی جزء مهمترین بخشهای سئو سایت میباشد',
        'توضیحات بخش متا به گوگل اعلام میکند که محتوای صفحه درباره چیست',
        'امروزه، نرمافزارهاي زیادي براي یادداشــتبرداري وجود دارند',
        'اعمال انسان بهترین مفسر افکار او هستند.',
        'هر کسی که متفاوت از یک جمع گرفتار بیندیشد یک فرد آزاد است.',
        'خرید انواع کالای دیجیتال از فروشگاه اینترنتی دیجی کالا ',
        'هفت روز هفته، ۲۴ ساعت شبانه‌روز پاسخگوی شما هستیم.',
        'مچ‌بندها و ساعت‌های هوشمند ابزارهای لازم برای پایش سلامت را در اختیار دارند',
        'تولیدکننده انواع دوربین‌های عکاسی و فیلم‌برداری و لوازم جانبی',
        'هارداکسترنال در گروه هاردهای ضدضربه و مقاوم دسته‌بندی می‌شود',
        'ارز دیجیتال ارزهایی هستند که به صورت الکترونیکی ذخیره و منتقل می‌شوند',
        'رایانه‌های نوین می‌توانند از مجموعهٔ بزرگی از کدها به نام برنامه پیروی کنند',
        'مراقب سلامتی خود باشید!',
        'سایپا مطمئن!',
        'از هدر رفت آب جلوگیری کنید.',
        'تولید متن تصادفی در ورد',
        'تحقیق در عملیات ۱ یکی از دروس اصلی رشته‌های مهندسی صنایع',
        'آیا تا به‌‌حال درمورد زباله‌‌های فضایی چیزی شنیده‌‌اید؟',
        'همه سلول‌ها دارای ساختارهای تخصصی و درون‌سلولی هستند',
        'تولید محتوا زیربنای استراتژی بازاریابی آنلاین است.',
        'محیط و مساحت دایره از مشخصات هندسی مهم دایره هستند',
        'واژه گرافیک ریشه‌ای یونانی دارد',
        'ساختار برگ گیاه برای تبادل گاز سازگار شده است.',
        'محیط نیم دایره مجموع نصف محیط دایره با قطر دایره است.',
        'داکر یک سکوی نرم افزاری است',
        'برای افرادی که قصد یادگیری زبان انگلیسی را دارند',
        'تبدیل شدن به یک معامله‌گر موفق در بورس',
    ];

    protected static array $paragraph = ['متاورس به عنوان یک شبکه‌ مجازی عمل کرده که در آن کاربران قادر خواهند بود با یکدیگر و با دیگر اجزای محیط اطراف خود تعامل کنند. به عبارتی دیگر، در دنیای متاورس افراد به صورت آنلاین و مجازی به نقش‌آفرینی می‌پردازند. این دنیای مجازی، جنبه‌های مختلف شبکه‌های اجتماعی،‌ بازی‌های ویدیوئی، فناوری واقعیت مجازی (VR) و واقعیت افزوده (AR) و در نهایت بلاک‌چین را با یکدیگر ادغام می‌کند. به همین دلیل متاورس را می‌توان به دنیایی که توسط واقعیت‌های مجازی و واقعیت‌های افزوده ساخته می‌شود هم نسبت داد. با افزایش نفوذ بلاک‌چین در دنیای فناوری، پای متاورس به بازی‌های بلاک‌چینی باز شد. بازی‌هایی که افراد در آن می‌توانند آیتم‌های بازی را در قالب ارز دیجیتال خریداری و معامله کنند. البته توجه داشته باشید نوع عملکرد بازی‌های متاورس در بلاک‌چین، تفاوتی با بازی‌های غیر بلاک‌چینی ندارد و فقط دارایی‌های بازیکن در بازی به توکن تبدیل شده است. با وجود اینکه هنوز خیلی با نمونه‌های کاربردی فناوری متاورس فاصله داریم اما این مفهوم مدتهای طولانی و برای چندین دهه است که در داستان‌ها، بازی‌های رایانه‌ای و فناوری‌های دیجیتال مطرح بوده است. در حقیقت واژه متاورس و خلق آن به دهه ۹۰ میلادی زمانی که نیل استفنسون (Neal Stephenson) کتابی با نام اِسنو کرَش (Snow Crash) منتشر کرد باز می‌گردد. این نویسنده در این کتاب برای اولین بار مفاهیمی مثل متاورس و آواتار (Avatar)  را در قالب داستان پیش‌بینی کرد. مفاهیمی که سالها بعد از آن با همین نام به دنیای دیجیتال راه پیدا کردند. این ماجرا به همین جا ختم نمی‌شود. مدت‌ها بعد نویسنده کتاب بازیکن شماره یک آماده (Ready Player One) ، ارنست کلاین (Ernest Cline) به روایت زندگی انسانها در سال ۲۰۴۴ می‌پردازد. در این کتاب روایت شده انسان‌ها می‌توانند زندگی مشقت‌باری که در دنیای واقعی دارند را با زندگی در دنیای مجازی و دیجیتال ادامه دهند. نگاهی به همه این جریانات و در نهایت تغییر نام فیس‌بوک به متا همه نشان‌دهنده این است که از گذشته تاکنون برنامه‌های زیادی برای مقوله متاورس وجود داشته است.'];

    public function word(): string
    {
        return self::randomElement(self::$word);
    }

    public function sentence(): string
    {
        return self::randomElement(self::$sentence);
    }

    public function paragraph(): string
    {
        return self::randomElement(self::$paragraph);
    }
}
